In [17]:
import numpy as np
import pandas as pd

In [18]:
data={'Company':['goog','goog','msft','msft','fb','fb'],'Person':['Sam','Karan','Riya','Piya','Aman','Jin'],'Sales':[100,234,180,150,160,290]}

In [19]:
df=pd.DataFrame(data)

In [20]:
df

  Company Person  Sales
0    goog    Sam    100
1    goog  Karan    234
2    msft   Riya    180
3    msft   Piya    150
4      fb   Aman    160
5      fb    Jin    290

In [21]:
bycomp=df.groupby('Company')

In [22]:
bycomp.mean()

         Sales
Company
fb         225
goog       167
msft       165

In [23]:
bycomp.sum()

         Sales
Company
fb         450
goog       334
msft       330

In [24]:
bycomp.std()

             Sales
Company
fb       91.923882
goog     94.752309
msft     21.213203

In [25]:
bycomp.sum().loc['fb']

Sales    450
Name: fb, dtype: int64

In [26]:
df.groupby('Company').count()

         Person  Sales
Company
fb            2      2
goog          2      2
msft          2      2

In [27]:
df

  Company Person  Sales
0    goog    Sam    100
1    goog  Karan    234
2    msft   Riya    180
3    msft   Piya    150
4      fb   Aman    160
5      fb    Jin    290

In [28]:
bycomp.max()

        Person  Sales
Company
fb         Jin    290
goog       Sam    234
msft      Riya    180

In [29]:
bycomp.min()

        Person  Sales
Company
fb        Aman    160
goog     Karan    100
msft      Piya    150

In [30]:
bycomp.describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
fb        2.0  225.0  91.923882  160.0  192.5  225.0  257.5  290.0
goog      2.0  167.0  94.752309  100.0  133.5  167.0  200.5  234.0
msft      2.0  165.0  21.213203  150.0  157.5  165.0  172.5  180.0

In [32]:
bycomp.describe().transpose()['goog']

Sales  count      2.000000
       mean     167.000000
       std       94.752309
       min      100.000000
       25%      133.500000
       50%      167.000000
       75%      200.500000
       max      234.000000
Name: goog, dtype: float64